pages/teacher.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Micro:bit teacher page</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Micro:bit teacher page</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/7-CS-micro">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Examples</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Samples</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Here are some pre-made apps for the Micro:bit that you can pre-load on the teacher Micro:bits to demonstrate to students.
<ul class="org-ul">
<li><a href="./doc/times_tables.py">Times tables</a>. The user can choose a table by holding the Micro:bit by the GND pin with one hand and tapping the 0 and 2 GPIO with the other. Once they've chosen, the A and B buttons will show that multiplication table. 
</li>
<li><a href="./doc/reflex.py">Reflex</a>. Two players hold the Micro:bit, each poised to press either Button A or B. A 'meh' face will be shown for a random interval of time, then image will change. At this point, both players try to hit their button as quickly as possible. The player with the fastest reflexes will have their button name shown on the screen. The game restarts automatically. 
</li>
<li><a href="./doc/snake.py">Snake</a>. The in-built accelerometer is used to 'draw' simple patterns on the LED display by tilting the device. The reset button on the back of the Micro:bit is used to reset the display.
</li>
<li><a href="./doc/bop-it.py">Bop-It</a>. The player holds the Micro:bit in their right hand, by the GND GPIO pin. The screen will give an instruction of which button/GPIO pin to press, then the user has a little under half a second to touch it. The time available reduces after each correct answer. The score is shown when the player makes a mistake or runs out of time. The reset button on the back of the Micro:bit starts a new game. A <a href="./doc/bop.hex">hex version</a> is also available to put straight onto the bit. 
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
